In [219]:
import numpy as np
from pandas import Series,DataFrame
import pandas as pd

In [220]:
df = DataFrame(np.arange(25).reshape((5,5)),index=['A','B','D','E','F'],columns=['col1','col2','col3','col4','col5'])
df

   col1  col2  col3  col4  col5
A     0     1     2     3     4
B     5     6     7     8     9
D    10    11    12    13    14
E    15    16    17    18    19
F    20    21    22    23    24

In [221]:
df['add'] = pd.Series(['a', 'b', np.nan, 'd']).str.cat(sep='')
df

   col1  col2  col3  col4  col5  add
A     0     1     2     3     4  abd
B     5     6     7     8     9  abd
D    10    11    12    13    14  abd
E    15    16    17    18    19  abd
F    20    21    22    23    24  abd

In [222]:
import pandas as pd

df = pd.read_csv('sample_pandas_normal.csv').head(3)
print(df)
#       name  age state  point
# 0    Alice   24    NY     64
# 1      Bob   42    CA     92
# 2  Charlie   18    CA     70

      name  age state  point
0    Alice   24    NY     64
1      Bob   42    CA     92
2  Charlie   18    CA     70

In [223]:
df['name-state'] = df['name'].str.cat(df['state'], sep=' in ')
print(df)

      name  age state  point     name-state
0    Alice   24    NY     64    Alice in NY
1      Bob   42    CA     92      Bob in CA
2  Charlie   18    CA     70  Charlie in CA

In [224]:
df2.index = new_index.values
df2

        col1  col2  col3  col4  col5  add
000203   NaN   NaN   NaN   NaN   NaN  NaN
040607   NaN   NaN   NaN   NaN   NaN  NaN
081011   NaN   NaN   NaN   NaN   NaN  NaN
121415   NaN   NaN   NaN   NaN   NaN  NaN

In [225]:
df = DataFrame(np.arange(25).reshape((5,5)))
df

    0   1   2   3   4
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19
4  20  21  22  23  24

In [226]:
import pandas as pd

df = pd.DataFrame({'a': ['abcde', 'fghij', 'klmno'],
                   'b': [123, 456.9, 'aaa']})
df['b']

0      123
1    456.9
2      aaa
Name: b, dtype: object

In [227]:
df = pd.DataFrame({'i': [20, 10, 200], 'f': [10, 0.9, 0.09],
                   's_i': ['0', '10', '200'], 's_f': ['0', '0.9', '0.09']})

print(df)

     i      f  s_i   s_f
0   20  10.00    0     0
1   10   0.90   10   0.9
2  200   0.09  200  0.09

In [228]:
df.dtypes

i        int64
f      float64
s_i     object
s_f     object
dtype: object

In [242]:
import pandas as pd
import json

s = '{"col1":{"row1":"one","row2":2,"row3":3.3}, \
      "col2":{"row1":"a","row2":"b","row3":["a","b","c"]}}'

df_s = pd.read_json(s)
df_s

     col1       col2
row1  one          a
row2    2          b
row3  3.3  [a, b, c]

In [231]:
df_f = pd.read_json('sample.json')

print(df_f)

     col1 col2
row1  one    a
row2    2    b
row3  3.3    c

In [233]:
df_f.to_json()

'{"col1":{"row1":"one","row2":2,"row3":3.3},"col2":{"row1":"a","row2":"b","row3":"c"}}'